---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsForHooksEnabled
source: html/bc9e8028-ed1c-bb34-c68d-d755dc540b81.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsForHooksEnabled Property

Identifies if the angular dimensions which has a reference set on a hook will be shown or not.

## Syntax (C#)
```csharp
public bool AngularDimensionsForHooksEnabled { get; set; }
```